//
//  MostPopularNumbers.swift
//  Leetcode
//
//  Created by Бучевский Андрей on 27.02.2024.
//

// Дан массив целых чисел nums и целое число k. Нужно написать функцию, которая вынимает из массива k наиболее часто встречающихся элементов.
//
// Пример
// # ввод
// nums = [1,1,1,2,2,3, 4, 4, 4]
// k = 2
// # вывод (в любом порядке)
// [1, 2]

import Foundation

func mostPopularNumbers(arr: [Int], target: Int) -> [Int] {
    var res: [(Int, [Int])] = []

    // [0: 0, 1: 3, 2: [2], 3: [1, 4]]
    // массив с ключем - кол-во повторений, значение - массив из чисел с таким же кол-во повторений
    //

    return []
}
